# AssemblyDifferenceMemberDifference Class (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
AssemblyDifferenceMemberDifference Class
Members See Also
---
The two assemblies being compared have different members
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2012
# Syntax
C#
---
```text
public class AssemblyDifferenceMemberDifference : AssemblyDifference
```

Visual Basic
---
```text
Public Class AssemblyDifferenceMemberDifference _
	Inherits AssemblyDifference
```

Visual C++
---
```text
public ref class AssemblyDifferenceMemberDifference : public AssemblyDifference
```

# Remarks
This difference means that there is a member of the first assembly which is different from the corresponding member of the second assembly. Details about the difference are in memberDifference.
# Inheritance Hierarchy
System..::..Object Autodesk.Revit.DB..::..AssemblyDifference Autodesk.Revit.DB..::..AssemblyDifferenceMemberDifference
# See Also
AssemblyDifferenceMemberDifference Members
Autodesk.Revit.DB Namespace